# Get Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabel..::..Get Method
AlignmentStationLabel Class See Also
---
Returns an AlignmentStationLabel object for the given element.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static AlignmentStationLabel Get(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function Get ( _
	element As Element _
) As AlignmentStationLabel
```

Visual C++
---
```text
public:
static AlignmentStationLabel^ Get(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..ElementThe element for which to return the object.
# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace